Repository: Itai-Lukio/lukio_user_forms
Catalog: lukio-user-forms/languages/lukio-user-forms-*.po
Languages: he_il

source: Lukio user forms
he_il: לוקיו טפסי משתמש

source: General Settings
he_il: הגדרות כלליות

source: Login Settings
he_il: הגדרות התחברות

source: Register Settings
he_il: הגדרות הרשמה

source: Extra css
he_il: אקסטרה css

source: Socials
he_il: רשתות חברתיות

source: Info
he_il: מידע

source: Save Settings
he_il: שמור הגדרות

source: Reset all Settings
he_il: איפוס הגדרות

source: No minimum
he_il: ללא מינימום

source: Encapsulate with '{{' and '}}' to use bold. {{Bold text}}
he_il: ניתן לעטוף עם '{{' ו'}}' להשתמש בטקסט מודגש. {{טקסט מודגש}}

source: * Registration errors are not editable due to WordPress not fully separating the error types
he_il: שגיאות הרשמה אינן נתנות לעריכה מאחר שוורדפרס לא מפרידה לפי סוג

source: Field label
he_il: תגית שדה

source: Field placeholder
he_il: ממלא מקום

source: Checkbox set with an empty meta or text, will not be saved
he_il: צ'אקבוקס עם מטא או טקסט ריק, לא ישמר

source: Meta can only include lowercase English characters and underscores
he_il: מטא יכול להיות רק באנגלית ולכלול רק אותיות קתנות וקו תחתון

source: Meta containing invalid characters will not be saved
he_il: מטא עם תווים לא חוקים לא ישמר

source: It is highly recommended to prefix metas, {prefix}_{meta_name}
he_il: מאוד מומלץ להשתמש בקידומת למטא,{prefix}_{meta_name}

source: Add checkbox
he_il: הוספת צ'אקבוקס

source: Settings
he_il: הגדרות

source: Click to copy
he_il: לחץ להעתיק

source: Copied
he_il: הועתק

source: Make checkbox required
he_il: הפוך צ'אקבוקס לחובה

source: Meta key
he_il: מטא

source: Checkbox text
he_il: צ'אקבוקס טקסט

source: Remove checkbox
he_il: הסרת צ'אקבוקד

source: User login
he_il: התחברות משתמש

source: User login placeholder
he_il: ממלא מקום שם משתמש

source: Password placeholder
he_il: ממלא מקום סיסמה

source: Required error
he_il: שגיאת שדה חובה

source: This input is required
he_il: השדה הזה הוא חובה

source: Password repeat label
he_il: תגית חזרה על סיסמה

source: Passwords don't match
he_il: סיסמאות לא תואמות

source: Switch to register
he_il: עבור להרשמה

source: Don't have an account?
he_il: עדין לא רשום?

source: Switch to login
he_il: עבור להתחברות

source: Already have an account?
he_il: כבר יש לך חשבון?

source: Minimum allowed password strength
he_il: חוזק סיסמה מינימלי

source: Use custom errors
he_il: שימוש בהודעות שגיאה מותאמות

source: Empty username error
he_il: שגיאת שם משתמש ריק

source: Empty password error
he_il: שגיאת סיסמה ריקה

source: Incorrect username error
he_il: שגיאת שם משתמש שגוי

source: Incorrect email error
he_il: שגיאת אימייל שגוי

source: Incorrect password error
he_il: שגיאת סיסמה שגויה

source: <strong>Error:</strong> The password you entered is incorrect.
he_il: <strong>שגיאה:</strong> הסיסמה שהכנסתה לא נכונה.

source: Reset password empty error
he_il: שגיאת שיחזור סיסמה ריק

source: Reset password no account error
he_il: שגיאת משתמש לא קיים

source: Invalid reset key error
he_il: שגיאת קוד איפוס סיסמה

source: Expired reset key error
he_il: קוד איפוס פג תוקף

source: Password empty space error
he_il: שגיאת סיסמה עם רווח

source: Password mismatch error
he_il: שגיאת סיסמאות לא זהות

source: Login title
he_il: כותרת התחברות

source: Login Form
he_il: טופס התחברות

source: Login submit
he_il: כפתור התחברות

source: Login remember label
he_il: תגית זכור משתמש

source: Lost password title
he_il: כותרת איפוס סיסמה

source: Lost password
he_il: איפוס סיסמה

source: Lost password submit
he_il: כפתור איפוס סיסמה

source: Reset password title
he_il: כותרת סיסמה חדשה

source: Reset password
he_il: סיסמה חדשה

source: Lost password success message
he_il: הודעת איפוס סיסמה נשלחה

source: Reset email has been sent to your email address
he_il: הודעת איפוס סיסמה נשלחה למייל שלך

source: Password reset success message
he_il: הודעת סיסמה חדשה נקלטה

source: Save Password button
he_il: כפתור שמור סיסמה

source: Register title
he_il: כותרת התחברות

source: Register Form
he_il: טופס הרשמה

source: Email placeholder
he_il: ממלא מקום אימייל

source: Extra register checkbox
he_il: אקסטרה צ'אקבוקס להרשמה

source: Use Google login
he_il: השתמש בהתחברות עם גוגל

source: Use Facebook login
he_il: השתמש בהתחברות עם פייסבוק

source: Repeat password
he_il: חזור על הסיסמה

source: Active field: %s
he_il: שדה פעיל: %s

source: Placeholder
he_il: ממלא מקום

source: Make field required
he_il: הפוך שדה לחובה

source: Itai Dotan @Lukio
he_il: איתי דותן @לוקיו

source: Easy login and register forms including lost password functionality.
he_il: טפסי התחברות והרשמה נוחים עם יכולת שיחזור סיסמה.
